/* *******************************************************************************************
// Author:      biu~
// Last Date:   2018/02/XX
// 以定时器溢出为时间基准，周期性的调用的函数
// 时基处理部分，及时基处理初始化
/* ******************************************************************************************* */

#include "TIME_BASE.H"

/* *******************************************************************************************
// 时基时钟初始化
/* ******************************************************************************************* */
// 利用STC-ISP软件导出此函数：
static void Timer0Init(void)		//50微秒@24.000MHz
{
	AUXR |= 0x80;		//定时器时钟1T模式
	TMOD &= 0xF0;		//设置定时器模式
	TL0 = 0x50;		//设置定时初值
	TH0 = 0xFB;		//设置定时初值
	TF0 = 0;		//清除TF0标志
	TR0 = 1;		//定时器0开始计时
}

// 时基定时器初始化并开启中断总开关：
void InitInterrupt()
{
#ifdef T_0
    Timer0Init();
    ET0 = 1;
#elif T_1
    Timer1Init();
    ET1 = 1;
#elif T_2
    Timer2Init();
    IE2 |= 0x04;
#endif
    EA = 1;
}

/* *******************************************************************************************
// 时基处理部分
/* ******************************************************************************************* */
void Timer_TimeBase_Isr () interrupt 1
{
    static u16 /*cp0, */cp1, cp2;
//    if (++ cp0 > OVERFLOW_TIMES_1ST)
//    {
//        cp0 = 0;
//        // 以OVERFLOW_TIMES_1ST为时基：
////        ReceiveIRdata4();
//    }
    if (++ cp1 > OVERFLOW_TIMES_2ND)
    {
        cp1 = 0;
        // 以OVERFLOW_TIMES_2ND为时基：
        Con_TimerPWM_Duty_Slow();
    }
    if (++ cp2 > OVERFLOW_TIMES_3RD)
    {
        cp2 = 0;
        // 以OVERFLOW_TIMES_3RD为时基：
        Con_TimerPWM_Duty_Fast();
    }
    // 以定时器溢出时长为时基：
    TimerPWM();
}
